IRP/src/AccumulationRegisters/InventoryBalance/InventoryBalance.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>InventoryBalance</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/InventoryBalance/ManagerModule.bsl
Function GetLockFields(Data) Export
	Result = New Structure();
	Result.Insert("RegisterName", "AccumulationRegister.InventoryBalance");
	Fields = New Map();
	Fields.Insert("Company", "Company");
	Fields.Insert("ItemKey", "ItemKey");
	Result.Insert("LockInfo", New Structure("Data, Fields", Data, Fields));
	Return Result;
EndFunction
